Repository: MuhammadTahaRandhawa/blood-doantion-clean-architecture-public
Catalog: lib/l10n/app_*.arb
Languages: ur

# tutorial_donationStep5
source: 5. Donate blood (takes about 10 minutes).
ur: 5. خون کا عطیہ دیں (تقریباً 10 منٹ لگتے ہیں)۔

# tutorial_donationStep6
source: 6. Rest for a few minutes at the donation center.
ur: 6. چند منٹ کے لیے چندہ مرکز میں آرام کریں۔

# tutorial_donationStep7
source: 7. Enjoy refreshments and snacks provided.
ur: 7. فراہم کردہ ریفریشمنٹ اور اسنیکس کا لطف اٹھائیں۔

# tutorial_donationStep8
source: 8. Drink plenty of fluids for the next 24 hours.
ur: 8. اگلے 24 گھنٹوں کے لیے کافی مقدار میں سیال پییں۔

# tutorial_donationStep9
source: 9. Avoid strenuous activities and heavy lifting for the rest of the day.
ur: 9. دن کے باقی حصوں میں سخت سرگرمیوں اور بھاری وزن اٹھانے سے گریز کریں۔

# tutorial_donationStep10
source: 10. Keep the bandage on for a few hours and avoid using the donation arm for heavy lifting.
ur: 10. پٹی کو چند گھنٹوں کے لیے رکھیں اور بھاری اٹھانے کے لیے عطیہ بازو کے استعمال سے گریز کریں۔

# tutorial_donationStep11
source: 11. If you feel lightheaded or dizzy, sit or lie down until you feel better.
ur: 11. اگر آپ کو ہلکا سر یا چکر آتا ہے، تو اس وقت تک بیٹھیں یا لیٹیں جب تک آپ بہتر محسوس نہ کریں۔

# tutorial_donationStep12
source: 12. Contact the donation center if you experience any unusual symptoms.
ur: 12. اگر آپ کو کوئی غیر معمولی علامات محسوس ہوتی ہیں تو عطیہ مرکز سے رابطہ کریں۔

# aboutUser_noImg
source: No Image
ur: کوئی تصویرنہیں

# aboutUser_msg
source: Message
ur: پیغام

# certificatePage_certificate
source: Here is your certificate!
ur: یہ رہا آپ کا سرٹیفکیٹ

# certificatePage_appBar
source: Blood Donation Certificate
ur: بلڈ ڈونیشن سرٹیفکیٹ

# certificatePage_gotCertificate
source: You have got a certificate
ur: آپ کو سرٹیفکیٹ مل گیا ہے

# certificatePage_certificateOf
source: CERTIFICATE OF
ur: کی سند

# certificatePage_savingContribution
source: LIFE SAVING CONTRIBUTION
ur: زندگی بچانے کا تعاون

# certificatePage_selfnessContibutionq
source: Your selfless contribution helps save lives and brings hope to those in need. Thank you for your commitment to making a difference
ur: آپ کا بے لوث تعاون زندگیاں بچانے میں مدد کرتا ہے اور ضرورت مندوں کے لیے امید لاتا ہے۔ فرق کرنے کے لیے آپ کے عزم کا شکریہ

# certificatePage_bloodDonation
source: Blood Donation
ur: خون کا عطیہ

# certificatePage_date
source: Date:
ur: تاریخ

# certificatePage_share
source: Share
ur: بانٹیں

# userProfile_dataUpdate
source: User Data Updated Successfully
ur: آپ کا ڈیٹا کامیابی سے اپ ڈیٹ ہو گیا ہے

# userProfile_myProfile
source: My Profile
ur: میری پروفائل

# userProfile_name
source: Name
ur: نام

# userProfile_phNo
source: Phone No
ur: فون نمبر

# userProfile_dob
source: Date of Birth
ur: تاریخ پیدائش

# userProfile_gender
source: Gender
ur: صنف

# userProfile_male
source: Male
ur: مرد

# userProfile_female
source: Female
ur: عورت

# userProfile_bGroup
source: Blood Group
ur: بلڈ گروپ

# userProfile_imgSource
source: Select Image Source
ur: تصویر کا ذریعہ منتخب کریں

# userProfile_camera
source: Camera
ur: کیمرہ

# userProfile_gallery
source: Gallery
ur: گیلری

# userToggle_contactInfo
source: Contact Info
ur: رابطہ کی معلومات

# userToggle_email
source: E-mail
ur: ای میل

# userToggle_phNo
source: Phone No
ur: فون نمبر

# userToggle_basicinfo
source: Basic Infomation
ur: بنیادی معلومات

# userToggle_dob
source: Date of Birth
ur: تاریخ پیدائش

# userToggle_gender
source: Gender
ur: صنف

# userToggle_moreInfo
source: More Info
ur: مزید معلومات

# userToggle_address
source: Address
ur: پتہ

# userToggle_bGroup
source: Blood Group
ur: بلڈ گروپ

# reviewToggle_allRating
source: Overall Rating
ur: مجموعی جائزہ

# reviewToggle_baseOn
source: Based on
ur: کی بنیاد پر

# reviewToggle_reviews
source: Reviews
ur: جائزے

# toggleprofile_about_me
source: About me
ur: میرے بارے میں

# toggleprofile_about_user
source: About user
ur: صارف کے بارے میں

# toggleprofile_userJourney
source: User Journey
ur: صارف کا تجربہ

# toggleprofile_reviews
source: Reviews
ur: جائزے

# toggleProView_pageNotExist
source: Page does not Exist
ur: صفحہ موجود نہیں ہے۔

# userJourney_appDate
source: appointmentDate
ur: ملاقات کی تاریخ

# userJourney_participantName
source: ParticipantName
ur: حصہ لینے والے کا نام

# userJourney_bGroup
source: Blood group
ur: بلڈ گروپ

# userJourney_appType
source: appointmentType
ur: ملاقات کی قسم

# userJourney_youDonateBlood
source: You donated blood to
ur: آپ نے خون کا عطیہ دیا۔

# userJourney_requestfrom
source: you requested blood from
ur: آپ نے خون مانگا تھا۔

# notSetting_appBar
source: Notification Settings
ur: نوٹیفکیشن سیٹنگز

# settingsType_notifcation
source: Notifications
ur: نوٹیفکیشن

# settingsType_msgAppointment
source: Messages , Appointments
ur: پیغامات، ملاقاتیں

# settingsType_theme
source: Theme
ur: تھیم

# settingsType_availableAsDonor
source: Available as donor
ur: آپ ڈونر کے طور پر دستیاب ہیں

# settingsType_appLanguage
source: App language
ur: ایپ کی زبان

# settingsType_contactUs
source: Contact Us
ur: ہم سے رابطہ کریں

# settingsType_chooseTheme
source: Choose Theme
ur: تھیم کا انتخاب کریں

# settingsType_light
source: Light
ur: روشنی

# settingsType_dark
source: Dark
ur: اندھیرا

# settingsType_deviceTheme
source: Device Current
ur: ڈیوائس کرنٹ

# settingsType_chooseAppLanguage
source: Choose App Language
ur: ایپ کی زبان کا انتخاب کریں۔

# settingsType_english
source: English
ur: انگریزی

# settingsType_urdu
source: Urdu
ur: اردو

# setting_appBar
source: Settings
ur: سیٹنگز

# notSettingTile_notifcation
source: Notification
ur: نوٹیفکیشن

# forgetPassPage_forgetPass
source: Forget Password
ur: پاس ورڈ یاد نہیں

# forgetPassPage_emailForReset
source: Please enter your email to reset the password
ur: پاس ورڈ دوبارہ ترتیب دینے کے لیے براہ کرم اپنا ای میل درج کریں

# forgetPassPage_yourEmail
source: Your Email
ur: آپ کا ای میل

# forgetPassPage_resetPass
source: Reset Password
ur: پاس ورڈ ری سیٹ

# loginPage_signAs
source: Signed in as
ur: داخل ہوں بطور

# loginPage_email
source: Email
ur: ای میل

# loginPage_pass
source: Password
ur: پاس ورڈ

# loginPage_forgetPass
source: Forgot password?
ur: پاسورڈ بھول گے؟

# loginPage_logInBtn
source: Log In
ur: لاگ ان

# loginPage_or
source: OR
ur: یا

# newPassPage_resetComplete
source: Password reset completed
ur: پاس ورڈ ری سیٹ مکمل ہو گیا۔

# newPassPage_setNewPass
source: Set a new password
ur: نیا پاس ورڈ سیٹ کریں۔

# newPassPage_differPrevious
source: Create a new password. Ensure it differs from previous ones for security.
ur: نیا پاس ورڈ بنائیں۔ یقینی بنائیں کہ یہ سیکورٹی کے لیے پچھلے سے مختلف ہے۔

# newPassPage_password
source: Password
ur: پاس ورڈ

# newPassPage_enterNewPass
source: Enter new Password
ur: نیا پاس ورڈ درج کریں

# newPassPage_confirmPass
source: Confirm Password
ur: پاس ورڈ کی تصدیق کریں۔

# newPassPage_reEnterPass
source: Re-enter Password
ur: پاس ورڈ دوبارہ درج

# newPassPage_passMustMatch
source: password must be matched
ur: پاس ورڈ مماثل ہونا ضروری ہے

# newPassPage_updatePass
source: Update Password
ur: پاس ورڈ اپ ڈیٹ

# signupPage_email
source: Email
ur: ای میل

# signupPage_pass
source: Password
ur: پاس ورڈ

# signupPage_signupBtn
source: Sign Up
ur: سائن اپ

# signupPage_alreadyAccount
source: Already have an account?
ur: پہلے سے ہی اکاؤنٹ ہے؟

# loginPage_alreadyAccount
source: Didn't have an account yet?
ur: ابھی تک اکاؤنٹ نہیں ہے؟

# verifyCode_chkEmail
source: Check your email
ur: اپنا ای میل چیک کریں۔

# verifyCode_sentLink
source: We sent a reset link to
ur: ہم نے ایک ری سیٹ لنک بھیجا

# verifyCode_enterCode
source: Enter the 5-digit code mentioned in the email
ur: ای میل میں مذکور 5 ہندسوں کا کوڈ درج کریں۔

# verifyCode_verifyCode
source: Verify Code
ur: کوڈ کی تصدیق کریں

# apponitDetail_no
source: N/A
ur: نہیں ہے

# apponitDetail_name
source: Name
ur: نام

# apponitDetail_phNo
source: Phone No
ur: فون نمبر

# apponitDetail_bGroup
source: Blood Group
ur: بلڈ گروپ

# apponitDetail_bloodBags
source: Blood Bags
ur: خون کے تھیلے

# myappointment_appBar
source: My Appointments
ur: میرے ملاقاتیں

# bloodAppointCard_userName
source: userName
ur: یوزر کا نام

# bloodAppointCard_viewDetail
source: View Details
ur: تفصیلات دیکھیں

# myAppointmentHome_myApp
source: My Appointments
ur: میری ملاقاتیں

# myAppointmentHome_viewMoreBtn
source: View More
ur: مزید دیکھیں

# myAppointmentHome_noApponitment
source: No appointments for today
ur: آج کے لیے کوئی ملاقاتیں نہیں ہیں۔

# appointments_page_noAppointment
source: No Appointment in this section
ur: اس سیکشن میں کوئی ملاقات نہیں

# myAppointmentHome_no
source: No
ur: نہیں

# myAppointmentHome_yes
source: Yes
ur: جی ہاں

# myAppointmentHome_haveDonate
source: Have you donated blood to
ur: کیا آپ نے خون کا عطیہ دیا ہے

# myAppointmentHome_received
source: Have you received blood from
ur: کیا آپ کو خون ملا ہے

# toogleAppointStatus_pending
source: pending
ur: غیر حتمی

# toogleAppointStatus_approve
source: Approved
ur: منظورشدہ

# toogleAppointStatus_inProgress
source: In Progress
ur: جاری ہے

# toogleAppointStatus_complete
source: Completed
ur: مکمل

# toogleAppointStatus_cancelled
source: Cancelled
ur: منسوخ

# commentpage_comnt
source: Comments
ur: کمنٹس

# commentpage_writecomment
source: Write a Comment...
ur: اپنی رائے لکھیں

# bottmnav_home
source: Home
ur: ہوم

# bottmnav_request
source: Request
ur: درخواست

# bottmnav_donation
source: Donations
ur: عطیات

# bottmnav_center
source: Center
ur: مرکز

# bottmnav_map
source: Map
ur: نقشہ

# bottmnav_bloodMap
source: Blood Map
ur: بلڈ میپ

# appDrawer_noImg
source: No Image
ur: کوئی تصویرنہیں

# appDrawer_profile
source: Profile
ur: پروفائل

# appDrawer_faq
source: FAQ
ur: عمومی سوالات

# appDrawer_setting
source: Settings
ur: سیٹنگز

# appDrawer_appTutorial
source: Tutorial
ur: ٹیوٹوریل

# appDrawer_certificate
source: Certificate
ur: سرٹیفیکیٹ

# appDrawer_logOut
source: Log Out
ur: لاگ آوٹ

# appDrawer_logOutfrom
source: Logout From IDonateLife
ur: آئی ڈونیٹ لائف سے لاگ آؤٹ کریں۔

# appDrawer_sureToLogout
source: Are you sure you want to logout?
ur: کیا آپ واقعی لاگ آؤٹ کرنا چاہتے ہیں؟

# appDrawer_no
source: No
ur: نہیں

# appDrawer_yes
source: Yes
ur: جی ہاں

# reportPopBtn_report
source: Report
ur: رپورٹ

# reportPopBtn_viewProfile
source: View Profile
ur: پروفائل دیکھیں

# reportPopBtn_selectreport
source: Select Report Type
ur: رپورٹ کی قسم منتخب کریں

# reportPopBtn_cancle
source: Cancel
ur: منسوخ کریں

# reportPopBtn_ok
source: OK
ur: ٹھیک ہے

# bloodShimmer_loading
source: Loading...
ur: ...لوڈ ہو رہا ہے

# bloodShimmer_plzWait
source: Please Wait
ur: برائے مہربانی انتظار کریں

# bloodFilter_searchInside
source: Search Inside Radius
ur: ریڈیئس کے اندر تلاش کریں

# bloodFilter_searchBlood
source: Search Blood Group
ur: بلڈ گروپ منتخب کریں

# radiusfilter_selectRadius
source: Selected Radius:
ur: رداس سلیکٹڈ کریں

# radiusfilter_km
source: Km
ur: کلومیٹر

# selectGender_male
source: Male
ur: مرد

# selectGender_female
source: Female
ur: عورت

# donationVerification_weight
source: Weight
ur: وزن

# donationVerification_weightStatement
source: Your Weigh atleast [50 kg] to donate blood.
ur: خون کا عطیہ دینے کے لیے آپ کا وزن کم از کم [50 کلوگرام] ہے۔

# donationVerification_health
source: Health
ur: صحت

# donationVerification_healthStatment
source: You can't donate blood if you have an infection, flu, or any other illness.
ur: اگر آپ کو انفیکشن، فلو، یا کوئی اور بیماری ہے تو آپ خون کا عطیہ نہیں کر سکتے۔

# donationVerification_meditation
source: Medications
ur: ادویات

# donationVerification_medistatment
source: Inform the Requester or Blood Center about any medications you are taking.
ur: آپ جو بھی دوائیں لے رہے ہیں اس کے بارے میں درخواست کنندہ یا بلڈ سینٹر کو مطلع کریں۔

# donationVerification_timing
source: Timing
ur: ٹائمنگ

# donationVerification_timingStatment
source: You can donate blood once every 3 months
ur: آپ ہر 3 ماہ میں ایک بار خون کا عطیہ دے سکتے ہیں۔

# donationVerification_iHaveRead
source: I have read all the Blood Donation Guidelines and accepted all the Terms & Condition
ur: میں نے خون کے عطیہ کے تمام رہنما خطوط پڑھ لیے ہیں اور تمام شرائط و ضوابط کو قبول کر لیا ہے۔
