Repository: MuhammadTahaRandhawa/blood-doantion-clean-architecture-public
Catalog: lib/l10n/app_*.arb
Languages: ur

# splash_largeButton
source: Get Started
ur: شروع کریں

# splash_loginButtonText1
source: Already have an account?
ur: پہلے سے ہی اکاؤنٹ ہے؟

# splash_loginButtonText2
source: SignIn
ur: لاگ ان کریں

# splash_slider1title
source: Donate blood, Save lives!
ur: خون دیں، زندگیں بچائیں!

# splash_slider1content
source: Welcome to iDonate Life 🩸, a mobile app that connects blood donors with those in need.
ur: آئی ڈونیٹ لائف 🩸 میں خوش آمدید، یہ ایک موبائل ایپ ہے جو خون کے عطیہ دہندگان کو ضرورت مندوں سے جوڑتی ہے

# splash_slider2title
source: Donate blood and make a difference
ur: آپ کا خون، کسی کی زندگی

# splash_slider2content
source: Every blood donation can save up to three lives. Become a hero in your community and join our mission.
ur: ہر خون کا عطیہ تین زندگیاں بچا سکتا ہے۔ اپنے محلے کے ہیرو بنیں اور ہمارے مشن میں شامل ہوں۔

# splash_slider3title
source: Need blood? Find donors near you.
ur: خون کی ضرورت ہے؟ اپنے قریبی عطیہ دہندگان تلاش کریں۔

# splash_slider3content
source: Search for compatible blood donors by blood type, location, and other criteria. Donate 🩸 makes it easy to find the help you need.
ur: بلڈ گروپ، مقام اور دیگر ضروریات کے مطابق مطابق عطیہ دہندگان تلاش کریں

# splash_slider4title
source: Donating blood is safe and simple.
ur: خون دینا محفوظ اور آسان ہے۔

# splash_slider4content
source: We'll guide you through every step of the donation process, from scheduling an appointment to understanding eligibility requirements.
ur: ہم آپ کو خون کے عطیہ کے عمل کے ہر مرحلے پر رہنمائی کریں گے، چاہے وہ اپوائنٹمنٹ بکنگ ہو یا اہلیت کے تقاضوں کو سمجھنا ہو

# splash_slider5title
source: Donate and Be Recognized
ur: عطیہ کریں اور سراہے جائیں

# splash_slider5content
source: We value your selfless act! After every successful blood donation, 🩸 rewards you with a digital certificate acknowledging your Donate contribution.
ur: ہم آپ کے بے لوث عمل کی قدر کرتے ہیں! خون کے ہر کامیاب عطیہ کے بعد، 🩸 آپ کو ایک ڈیجیٹل سرٹیفکیٹ کے ساتھ انعام دیتا ہے جس میں آپ کے عطیہ کے تعاون کو تسلیم کیا جاتا ہے۔

# splash_slider6title
source: Pakistan's first blood donation app with cutting-edge features
ur: پاکستان کا پہلا خون عطیہ ایپ، جدید ترین خصوصیات کے ساتھ

# splash_slider6content
source: We're proud to be Pakistan's first blood donation app offering a comprehensive and user-friendly experience.
ur: ہمیں فخر ہے کہ ہم پاکستان کا پہلا ایسا خون عطیہ ایپ ہیں جو ایک جامع اور صارف دوست تجربہ پیش کرتا ہے

# splash_slider7title
source: Let's save lives together.
ur: آئیے مل کر جانیں بچائیں

# splash_slider7content
source: Download the iDonate Life app and register today to become a blood donor or find blood easily. Together, we can make a difference!
ur: آئی ڈونیٹ لائف ایپ ڈاؤن لوڈ کریں اور بلڈ ڈونر بننے یا آسانی سے خون تلاش کرنے کے لیے آج ہی رجسٹر ہوں۔ ایک ساتھ، ہم ایک فرق لا سکتے ہیں!

# basicInfo_Appbar
source: Basic Information
ur: بنیادی معلومات

# basicInfo_fullName
source: Enter Full Name
ur: اپنا پورا نام لکھیں

# basicInfo_CNIC
source: Enter CNIC without (-)
ur: (-) بغیر CNIC لکھیں

# basicInfo_PhNum
source: Enter Phone No
ur: اپنا فون نمبر درج کریں

# basicInfo_DOB
source: Enter Date of Birth
ur: اپنی تاریخ پیدائش لکھیں

# basicInfo_Gender
source: Choose Gender
ur: اپنی جنس منتخب کریں

# basicInfo_Male
source: Male
ur: مرد

# basicInfo_female
source: Female
ur: عورت

# basicInfo_chooseBlood
source: Choose Blood Group
ur: اپنا بلڈ گروپ منتخب کریں۔

# basicInfo_BecomeDonor
source: Become a donor in IDonate Life
ur: آئی ڈیونیٹ لائف میں ڈونر بنیں

# basicInfo_submitBtn
source: Submit
ur: جاری کریں

# bloodCenterApoint_appbar
source: Schedule Appointment
ur: ملاقات طے کریں

# bloodCenterApoint_fullName
source: Enter Full Name
ur: اپنا پورا نام لکھیں

# bloodCenterApoint_PhNo
source: Enter Phone No
ur: اپنا فون نمبر درج کریں

# bloodCenterApoint_BloodBags
source: Blood Bags
ur: خون کے تھیلے

# bloodCenterApoint_case
source: Case
ur: معاملہ

# bloodCenterApoint_SubmitBtn
source: Submit
ur: جاری کریں

# bloodCenterdetail_reportSubmit
source: Report successfuly submitted
ur: رپورٹ جمع کروا دی گئی

# bloodCenterdetail_SubmitError
source: Error Submitting Report
ur: رپورٹ جمع کرانے میں خرابی آ گئی

# bloodCenterdetail_Name
source: Name
ur: نام

# bloodCenterdetail_PhNo
source: Phone Number
ur: فون نمبر

# bloodCenterdetail_Address
source: Address
ur: ایڈریس

# bloodCenterdetail_ScheduleAppointment
source: Schedule Appointment
ur: ملاقات طے کریں

# bloodCenterPage_NotFindCenter
source: Did not find any blood center in this area at the moment
ur: اس وقت اس علاقے میں کوئی بلڈ سینٹر نہیں ملا

# bloodCenterCard_view
source: View
ur: دیکھیں

# bloodCenterCard_Schedule
source: Schedule
ur: شیڈول

# bloodCenterDetailInfo_RatingCaluclated
source: How ratings are calculated
ur: ریٹنگ کا حساب کیسے لگایا جاتا ہے

# bloodCenterDetailInfo_RatingSolution
source: Ratings are based on recent reviews from people in your region
ur: ریٹنگز آپ کے علاقے کے لوگوں کے حالیہ جائزوں پر مبنی ہیں

# bloodCenterDetailInfo_OkBtn
source: OK
ur: ٹھیک ہے

# bloodCenterDetailInfo_time
source: time
ur: وقت

# bloodHeader_bloodCenter
source: Blood Center
ur: بلڈ سینٹر

# bloodCenterMap_ErrorImage
source: Error Fetching Map Image
ur: نقشہ کی تصویر لوڈ نہیں ہو سکی

# bloodDonationDetail_reportSubmit
source: Report successfuly submitted
ur: رپورٹ جمع کروا دی گئی

# bloodDonationDetail_SubmitError
source: Error Submitting Report
ur: رپورٹ جمع کرانے میں خرابی آ گئی

# bloodDonationDetail_Name
source: Name
ur: نام

# bloodDonationDetail_bloodGroup
source: Blood Group
ur: بلڈ گروپ

# bloodDonationDetail_PhNo
source: Phone Number
ur: فون نمبر

# bloodDonationDetail_address
source: Address
ur: ایڈریس

# bloodDonationDetail_askHelp
source: Ask Help
ur: مدد حاصل کریں

# bloodDonationPage_NotFindDonation
source: Did not find any donation in this area at the moment, try adjusting your search
ur: اس وقت اس علاقے میں کوئی عطیہ نہیں ملا، اپنی تلاش کو ایڈجسٹ کرنے کی کوشش کریں

# donationGuid_Guidline
source: Donation Guidelines
ur: عطیہ کی ہدایات

# donationGuid_ReadCarefully
source: Read carefully and accept all the terms and conditions
ur: غور سے پڑھیں اور تمام شرائط و ضوابط کو قبول کریں

# donationGuid_AgreeCont
source: Agree and Continue
ur: ٹھیک ہے جاری رکھیں

# bloodDonationcard_view
source: View
ur: دیکھیں

# bloodDonationcard_AskHelp
source: Ask Help
ur: مدد حاصل کریں

# bloodDonationHeader_donorAvailable
source: Donor Available
ur: موجودہ ڈونر

# donationInfo_ratingCaluclated
source: How ratings are calculated
ur: ریٹنگ کا حساب کیسے لگایا جاتا ہے

# donationInfo_RatingSolution
source: Ratings are based on recent reviews from people in your region
ur: ریٹنگز آپ کے علاقے کے لوگوں کے حالیہ جائزوں پر مبنی ہیں

# donationInfo_okBtn
source: OK
ur: ٹھیک ہے

# donationLocationMap_imgError
source: Error Fetching Map Image
ur: نقشہ کی تصویر لوڈ نہیں ہو سکی

# bloodMapPage_appbar
source: Blood Map
ur: بلڈ میپ

# customMap_findRoute
source: Find Route
ur: رستہ تلاش کریں

# customMap_viewDetail
source: View Details
ur: تفصیلات دیکھیں

# addNewReq_appBar
source: New Request
ur: نئی درخواست

# addNewReq_fullName
source: Enter Full Name
ur: پورا نام درج کریں

# addNewReq_PhNo
source: Phone Number
ur: فون نمبر

# addNewReq_bloodBag
source: Blood Bags
ur: خون کے تھیلے

# addNewReq_hospital
source: Hospital (Optional)
ur: ہسپتال (اختیاری)

# addNewReq_chooseLocation
source: Choose a Location
ur: جگہ منتخب کریں

# addNewReq_submitBtn
source: Submit
ur: جاری کریں

# bloodReqDetail_ReportSubmit
source: Report successfuly submitted
ur: رپورٹ جمع کروا دی گئی

# bloodReqDetail_submitError
source: Error submitting a report
ur: رپورٹ جمع کرانے میں خرابی آ گئی

# bloodReqDetail_name
source: Name
ur: نام

# bloodReqDetail_bloodGroup
source: Blood Group
ur: بلڈ گروپ

# bloodReqDetail_PhNo
source: Phone Number
ur: فون نمبر

# bloodReqDetail_address
source: Address
ur: ایڈریس

# bloodReqDetail_hospital
source: Hospital
ur: ہسپتال

# bloodReqDetail_help
source: Help
ur: مدد

# bloodReqPage_appBar
source: Blood Requests
ur: خون کی درخواستیں

# bloodReqPage_notFindReq
source: Did not find any request in this area at the moment, try adjusting your search
ur: اس علاقے میں اس وقت کوئی درخواست نہیں ملی، اپنی تلاش کو ایڈجسٹ کرنے کی کوشش کریں

# mybloodReqPage_appBar
source: My Blood Requests
ur: میری خون کی درخواستیں

# mybloodReqPage_notHaveReq
source: Oops you don't have any blood request, Try adding One
ur: افوہ آپ کے پاس خون کی کوئی درخواست نہیں ہے، ایک شامل کرنے کی کوشش کریں

# selectReqLoc_selectLoc
source: Select Request Location
ur: درخواست کی جگہ کو منتخب کریں

# selectReqLoc_done
source: Done
ur: مکمل

# bloodReqCard_view
source: View
ur: دیکھیں

# bloodReqCard_select
source: Select
ur: منتخب کریں

# bloodReqCard_help
source: Help
ur: مدد

# bloodReqheader_newReq
source: New Requests
ur: نئی درخواستیں

# bloodReqheader_myReq
source: My Requests
ur: میری درخواستیں

# maxLimChk_reachLim
source: Maximum limit reached
ur: حدِ مِقدار پوری ہو چکی ہے

# maxLimChk_twiceAReq
source: You can only request blood twice a day
ur: آپ دن میں صرف دو بار خون کی درخواست کر سکتے ہیں

# maxLimChk_okBtn
source: Ok
ur: ٹھیک ہے

# reqInfo_calculatedRating
source: How ratings are calculated
ur: ریٹنگ کا حساب کیسے لگایا جاتا ہے

# reqInfo_ratingBased
source: Ratings are based on recent reviews from people in your region
ur: ریٹنگز آپ کے علاقے کے لوگوں کے حالیہ جائزوں پر مبنی ہیں

# reqInfo_okBtn
source: Ok
ur: ٹھیک ہے

# reqLocMap_errorfetchImg
source: Error Fetching Map Image
ur: نقشہ کی تصویر لوڈ نہیں ہو سکی

# reqLocInputMap_chooseloc
source: Choose A Location
ur: جگہ منتخب کریں

# chatPage_appBar
source: Blood Chat
ur: بلڈ چیٹ

# chatPage_noChat
source: You don't have any chat yet
ur: آپ نے ابھی تک کوئی چیٹ شروع نہیں کی ہے

# msgPage_reportSubmit
source: Report successfuly submitted
ur: رپورٹ جمع کروا دی گئی

# msgPage_submitError
source: Error submitting a report
ur: رپورٹ جمع کرانے میں خرابی آ گئی

# msgPage_sendMsg
source: Send A Message to Start Conversation
ur: بات چیت شروع کرنے کے لیے ایک پیغام بھیجیں

# msgPage_typeMsg
source: Type a message...
ur: ...ایک پیغام ٹائپ کریں

# msgPage_needHelp
source: Needs Your Help
ur: کو آپ کی مدد کی ضرورت ہے

# msgPage_willingHelp
source: is willing to help you
ur: آپ کی مدد کرنے کو تیار ہے

# chatCard_you
source: You
ur: آپ

# donMsgBubble_askHelp
source: You asked for help
ur: آپ نے مدد مانگی

# donMsgBubble_imgError
source: Error Fetching Map Image
ur: نقشہ کی تصویر لوڈ نہیں ہو سکی

# donMsgBubble_viewBtn
source: View
ur: دیکھیں

# donMsgBubble_helpBtn
source: Help
ur: مدد

# donMsgBubble_wantHelp
source: wants to help you
ur: آپ کی مدد کرنا چاہتا ہے

# donMsgBubble_acceptDonation
source: Accept Donation
ur: عطیہ قبول کریں

# donMsgBubble_reminder
source: Reminder
ur: یاد رکھیں

# donMsgBubble_haveAppointment
source: you have an appointment now with
ur: آپ کے ساتھ ابھی ملاقات ہے

# faqData_qes1
source: Who can donate blood?
ur: کون خون عطیہ کر سکتا ہے؟

# faqData_ans1
source: A blood donor must: be in good general health be aged 18 years or older but less than 60 years weigh at least 45 Kg have a hemoglobin level of at least 12.5 g/dl not have donated blood in the last 3 months
ur: خون کا عطیہ کرنے والے کے لیے ضروری ہے: اچھی صحت مند ہو اس کی عمر 18 سال یا اس سے زیادہ ہو لیکن 60 سال سے کم جس کا وزن کم از کم 45 کلو گرام ہو جس میں ہیموگلوبن کی سطح کم از کم 12.5 جی فی ڈی ایل ہو اس نے پچھلے 3 مہینوں میں خون کا عطیہ نہیں کیا ہے۔

# faqData_qes2
source: Who cannot donate blood?
ur: کون خون عطیہ نہیں کر سکتا؟

# faqData_ans2
source: Blood must not be donated if a person is suffering from any of these conditions: Cold/ fever in the past 1 week Under treatment with antibiotics or any other medication Cardiac problems, hypertension, epilepsy, diabetes (on insulin therapy), history of cancer, chronic kidney or liver disease, bleeding tendencies, venereal disease Major surgery in the last 6 months or minor surgery in the past 3 months Jaundice or hepatitis or positivity for Hepatitis B or C viruses Tooth extraction less than 3 days back or dental surgery less than 1 month back Fainting attacks during the last donation On therapy with regular blood transfusions Sharing needles to inject drugs/ having history of drug addiction Sexual relations with different partners or with a high risk individual Been tested positive for antibodies to HIV Any endocrinal problem Females should not donate blood during pregnancy. They can donate after 6 months following delivery and when they are not breast feeding Females should not donate blood if they are having heavy menstrual flow or menstrual cramps Miscarriage in the last 6 months
ur: اگر کوئی شخص ان میں سے کسی بھی حالت میں مبتلا ہو تو خون کا عطیہ نہیں کرنا چاہیے: پچھلے 1 ہفتے میں سردی/بخار اینٹی بائیوٹکس یا کسی دوسری دوائی سے زیر علاج دل کے مسائل، ہائی بلڈ پریشر، مرگی، ذیابیطس (انسولین تھراپی پر)، کینسر کی تاریخ، دائمی گردے یا جگر کی بیماری، خون بہنے کے رجحانات، عصبی بیماری گزشتہ 6 مہینوں میں بڑی سرجری یا پچھلے 3 مہینوں میں معمولی سرجری یرقان یا ہیپاٹائٹس یا ہیپاٹائٹس بی یا سی وائرس کے لیے مثبتیت 3 دن سے کم پہلے دانت نکالنا یا دانتوں کی سرجری 1 سے کم مہینہ پہلے آخری عطیہ کے دوران بیہوشی کے حملے باقاعدگی سے خون کی منتقلی کے ساتھ تھراپی پر منشیات انجیکشن لگانے کے لئے سوئیاں بانٹنا/ نشے کی لت کی تاریخ مختلف شراکت داروں کے ساتھ جنسی تعلقات یا زیادہ خطرہ والے فرد کے ساتھ ایچ آئی وی کے اینٹی باڈیز کے لئے مثبت تجربہ کیا گیا کسی بھی اینڈوکرائنل مسئلہ خواتین کو عطیہ نہیں کرنا چاہئے۔ حمل کے دوران خون. وہ ڈیلیوری کے بعد 6 ماہ کے بعد عطیہ کر سکتے ہیں اور جب وہ دودھ نہیں پلا رہے ہوں تو خواتین کو خون کا عطیہ نہیں کرنا چاہئے اگر انہیں ماہواری میں شدید بہاؤ یا ماہواری میں درد ہو رہا ہو یا پچھلے 6 مہینوں میں اسقاط حمل ہو

# faqData_qes3
source: How does one make sure that the blood is safe for patients?
ur: کوئی کیسے یقینی بناتا ہے کہ خون مریضوں کے لیے محفوظ ہے؟

# faqData_ans3
source: Some diseases can be transmitted through blood transfusion. Therefore, all donated blood is screened for transfusion transmissible diseases such as HIV, Hepatitis B, Hepatitis C, Syphilis and Malaria. Even with testing, sometimes infections are not detected, although the rate of detection is extremely good with better methods of testing (e.g. NAT).
ur: کچھ بیماریاں خون کی منتقلی کے ذریعے منتقل ہو سکتی ہیں۔ لہٰذا، تمام عطیہ کردہ خون کی منتقلی سے منتقل ہونے والی بیماریوں جیسے ایچ آئی وی، ہیپاٹائٹس بی، ہیپاٹائٹس سی، سیفیلس اور ملیریا کے لیے اسکریننگ کی جاتی ہے۔ یہاں تک کہ جانچ کے باوجود، بعض اوقات انفیکشنز کا پتہ نہیں چلتا ہے، حالانکہ جانچ کے بہتر طریقوں (جیسے NAT) کے ساتھ پتہ لگانے کی شرح بہت اچھی ہے۔

# faqData_qes4
source: How often can I donate blood?
ur: میں کتنی بار خون کا عطیہ دے سکتا ہوں؟

# faqData_ans4
source: It is safe to donate blood once in every three months.
ur: ہر تین ماہ میں ایک بار خون کا عطیہ دینا محفوظ ہے۔

# faqData_qes5
source: Why do I have to wait 3 months before donating again?
ur: مجھے دوبارہ عطیہ کرنے سے پہلے 3 ماہ انتظار کیوں کرنا پڑے گا؟

# faqData_ans5
source: Since blood contains iron (which is essential for making new red blood cells), donating blood more often than every 3 months causes the body to lose iron faster than it can be made up from iron-containing foods in our diet. As a result the donor could develop iron deficiency anemia, causing him/her to feel weak and tired.
ur: چونکہ خون میں آئرن ہوتا ہے (جو خون کے نئے سرخ خلیات بنانے کے لیے ضروری ہوتا ہے) لہٰذا ہر 3 ماہ بعد زیادہ مرتبہ خون کا عطیہ دینے سے جسم میں آئرن کی کمی اس تیزی سے ہوتی ہے جتنا کہ ہماری خوراک میں آئرن والی غذاؤں سے بنایا جا سکتا ہے۔ نتیجے کے طور پر عطیہ دہندہ لوہے کی کمی کا انیمیا پیدا کر سکتا ہے، جس کی وجہ سے وہ کمزوری اور تھکاوٹ محسوس کر سکتا ہے۔

# faqData_qes6
source: Why is it important to donate blood?
ur: خون کا عطیہ دینا کیوں ضروری ہے؟

# faqData_ans6
source: Blood can be a life-saving therapy for patients. One unit of blood can save 4 lives (if it is separated into components). Healthy people should donate blood regularly and voluntarily to overcome shortage of blood for patients. It has been proven worldwide that voluntary donations are the safest of all kinds of donations.
ur: خون مریضوں کے لیے زندگی بچانے والا علاج ہو سکتا ہے۔ خون کا ایک یونٹ 4 جانیں بچا سکتا ہے (اگر اسے اجزاء میں الگ کر دیا جائے)۔ صحت مند افراد کو چاہیے کہ وہ باقاعدگی سے اور رضاکارانہ طور پر خون کا عطیہ دیں تاکہ مریضوں کے لیے خون کی قلت پر قابو پایا جا سکے۔ دنیا بھر میں یہ ثابت ہو چکا ہے کہ رضاکارانہ عطیات ہر قسم کے عطیات میں سب سے محفوظ ہیں۔

# faqData_qes7
source: Why are replacement/directed and paid donations not safe?
ur: متبادل/ہدایت یافتہ اور ادا شدہ عطیات کیوں محفوظ نہیں ہیں؟

# faqData_ans7
source: Replacement donations are donations in which the patient is asked to arrange blood for him/herself. If the blood group of the donor and the patient match, the blood is transfused (directed donations). If they do not match, the blood is stocked and a group-match blood is issued (replacement donations). Replacement donations have a higher rate of transfusion transmissible infections than voluntary donations. Paid donations are highly unsafe because they are usually given by people for ulterior motives (e.g. drug addicts) and have a very high rate of transfusion transmissible infections. Even the most sophisticated methods of testing available may fail to detect such infections. Therefore, it is important that voluntary donations by anonymous donors, for altruistic reasons are promoted.
ur: متبادل عطیات وہ عطیات ہیں جن میں مریض سے کہا جاتا ہے کہ وہ اپنے لیے خون کا بندوبست کرے۔ اگر عطیہ کرنے والے اور مریض کے خون کا گروپ آپس میں مماثل ہے تو خون منتقل کیا جاتا ہے (ہدایت شدہ عطیات)۔ اگر وہ مماثل نہیں ہیں تو، خون کا ذخیرہ کیا جاتا ہے اور ایک گروپ میچ خون جاری کیا جاتا ہے (متبادل عطیات)۔ متبادل عطیات میں رضاکارانہ عطیات کے مقابلے میں منتقلی کے قابل منتقلی انفیکشن کی شرح زیادہ ہوتی ہے۔ ادا شدہ عطیات انتہائی غیر محفوظ ہیں کیونکہ وہ عام طور پر لوگوں کی طرف سے غلط مقاصد کے لیے دیے جاتے ہیں (مثلاً منشیات کے عادی افراد) اور ان میں منتقلی کے قابل منتقلی انفیکشن کی شرح بہت زیادہ ہوتی ہے۔ یہاں تک کہ دستیاب جانچ کے جدید ترین طریقے بھی ایسے انفیکشن کا پتہ لگانے میں ناکام ہو سکتے ہیں۔ لہذا، یہ ضروری ہے کہ گمنام عطیہ دہندگان کی طرف سے رضاکارانہ عطیات، پرہیزگاری وجوہات کی بناء پر فروغ دیے جائیں۔

# faqData_qes8
source: What if I faint during a blood donation?
ur: اگر میں خون کے عطیہ کے دوران بیہوش ہو جاؤں؟

# faqData_ans8
source: The likelihood of this happening is minimal. You should eat before donating and drink extra fluids, especially after donation.
ur: ایسا ہونے کا امکان کم سے کم ہے۔ آپ کو عطیہ کرنے سے پہلے کھانا اور اضافی سیال پینا چاہیے، خاص طور پر عطیہ کے بعد۔

# faqData_qes9
source: Will a blood donation hurt?
ur: کیا خون کا عطیہ دینے سے تکلیف ہوگی؟

# faqData_ans9
source: Giving blood is not painful. You may feel a prick when the needle is inserted, which lasts only a few seconds.
ur: خون دینا تکلیف دہ نہیں ہے۔ جب سوئی ڈالی جاتی ہے تو آپ کو چبھن محسوس ہوسکتی ہے، جو صرف چند سیکنڈ تک رہتی ہے۔

# faqData_qes10
source: Will I become weak if I donate frequently?
ur: کیا میں کثرت سے چندہ دینے سے کمزور ہو جاؤں گا؟

# faqData_ans10
source: No. It is perfectly healthy to donate blood once every 3 months.
ur: نہیں، ہر 3 ماہ میں ایک بار خون کا عطیہ دینا بالکل صحت مند ہے۔

# faqData_qes11
source: Will I get AIDS if I donate blood?
ur: اگر میں خون کا عطیہ دوں تو کیا مجھے ایڈز ہو جائے گا؟

# faqData_ans11
source: Absolutely not! All equipment used to collect blood are sterile. These items are used once and discarded.
ur: بالکل نہیں! خون جمع کرنے کے لیے استعمال ہونے والے تمام آلات جراثیم سے پاک ہیں۔ یہ اشیاء ایک بار استعمال ہوتی ہیں اور ضائع کردی جاتی ہیں۔

# faqData_qes12
source: What are the components of blood and how are they used?
ur: خون کے اجزاء کیا ہیں اور ان کا استعمال کیسے کیا جاتا ہے؟

# faqData_ans12
source: There are four components in blood: red blood cells, white blood cells, platelets and plasma. Red blood cells supply oxygen to various parts of the body. White blood cells fight against disease or infections. Plasma carries nutrients, clotting factors and enzymes. Platelets help clot the blood to prevent excessive bleeding. Today, doctors transfuse individual blood components based upon the patient’s needs. Major categories of patient needs include: cancer therapy, organ transplants, accident victims and people undergoing elective surgical procedures.
ur: خون میں چار اجزاء ہوتے ہیں: خون کے سرخ خلیے، خون کے سفید خلیے، پلیٹ لیٹس اور پلازما۔ خون کے سرخ خلیے جسم کے مختلف حصوں کو آکسیجن فراہم کرتے ہیں۔ خون کے سفید خلیے بیماری یا انفیکشن سے لڑتے ہیں۔ پلازما میں غذائی اجزاء، جمنے کے عوامل اور خامرے ہوتے ہیں۔ پلیٹ لیٹس خون کو جمنے میں مدد کرتے ہیں تاکہ زیادہ خون بہنے سے بچ سکے۔ آج، ڈاکٹر مریض کی ضروریات کی بنیاد پر خون کے انفرادی اجزاء منتقل کرتے ہیں۔ مریضوں کی ضروریات کے بڑے زمرے میں شامل ہیں: کینسر کی تھراپی، اعضاء کی پیوند کاری، حادثے کا شکار ہونے والے اور انتخابی جراحی کے طریقہ کار سے گزرنے والے افراد۔

# faqData_qes13
source: How long can blood be stored?
ur: خون کب تک ذخیرہ کیا جا سکتا ہے؟

# faqData_ans13
source: Red cells - 35 days Platelets - 5 days Fresh frozen plasma - 1 year
ur: سرخ خلیے - 35 دن پلیٹلیٹس - 5 دن تازہ منجمد پلازما - 1 سال

# faqData_qes14
source: How long does it take to give blood?
ur: خون دینے میں کتنا وقت لگتا ہے؟

# faqData_ans14
source: Typically only about one hour.
ur: عام طور پر صرف ایک گھنٹہ۔

# faqData_qes15
source: Which Blood Group can donate to which blood group?
ur: کون سا بلڈ گروپ کس بلڈ گروپ کو عطیہ کر سکتا ہے؟

# faqData_ans15
source: O-: Universal donor (can donate to all blood groups: O-, O+, A-, A+, B-, B+, AB-, AB+) O+: Can donate to O+, A+, B+, AB+ A-: Can donate to A-, A+, AB-, AB+ A+: Can donate to A+, AB+ B-: Can donate to B-, B+, AB-, AB+ B+: Can donate to B+, AB+ AB-: Can donate to AB- and AB+ AB+: Universal recipient (can only donate to AB+)
ur: O-: یونیورسل ڈونر (تمام بلڈ گروپس کو عطیہ کر سکتا ہے: O-, O+, A-, A+, B-, B+, AB-, AB+) O+: O+, A+, B+, AB+ کو عطیہ کر سکتے ہیں۔ A-: A-, A+, AB-, AB+ کو عطیہ کر سکتے ہیں۔ A+: A+, AB+ کو عطیہ کر سکتے ہیں۔ B-: B-, B+, AB-, AB+ کو عطیہ کر سکتے ہیں۔ B+: B+, AB+ کو عطیہ کر سکتے ہیں۔ AB-: AB- اور AB+ کو عطیہ کر سکتے ہیں۔ AB+: یونیورسل وصول کنندہ (صرف AB+ کو عطیہ دے سکتا ہے)

# faqData_qes16
source: Which Blood Group can recieve from which blood group?
ur: کون سا بلڈ گروپ کس بلڈ گروپ سے حاصل کر سکتا ہے؟

# faqData_ans16
source: O-: Can receive only from O- O+: Can receive from O- and O+ A-: Can receive from O- and A- A+: Can receive from O-, O+, A-, A+ B-: Can receive from O- and B- B+: Can receive from O-, O+, B-, B+ AB-: Can receive from O-, A-, B-, AB- AB+: Universal recipient (can receive from all blood types: O-, O+, A-, A+, B-, B+, AB-, AB+)
ur: O-: صرف O- سے وصول کر سکتے ہیں O+: O- اور O+ سے وصول کر سکتے ہیں۔ A-: O- اور A- سے وصول کر سکتے ہیں A+: O-, O+, A-, A+ سے وصول کر سکتے ہیں۔ B-: O- اور B- سے وصول کر سکتے ہیں B+: O-, O+, B-, B+ سے وصول کر سکتے ہیں۔ AB-: O-، A-، B-، AB- سے وصول کر سکتے ہیں AB+: یونیورسل وصول کنندہ (خون کی تمام اقسام سے وصول کر سکتا ہے: O-, O+, A-, A+, B-, B+, AB-, AB+)

# faqData_appBar
source: FAQ
ur: عمومی سوالات

# homeTop_welcome
source: Welcome
ur: خوش آمدید

# homeTop_donatingGood
source: Donating blood is also good for donor's body
ur: خون کا عطیہ دینے والے کے جسم کے لیے بھی اچھا ہے۔

# tutorial_appBar
source: Blood Donation Tutorial
ur: خون کا عطیہ دینے کا طریقہ

# tutorial_donationSteps
source: Blood Donation Steps
ur: خون کے عطیہ کے اقدامات

# tutorial_donationStep1
source: 1. Ensure you meet the eligibility criteria.
ur: یقینی بنائیں کہ آپ اہلیت کے معیارات پر پورا اترتے ہیں۔ .1

# tutorial_donationStep2
source: 2. Drink plenty of water and eat a healthy meal before donating.
ur: 2. عطیہ کرنے سے پہلے کافی مقدار میں پانی پئیں اور صحت بخش کھانا کھائیں۔

# tutorial_donationStep3
source: 3. Bring a valid ID to the donation center.
ur: 3. عطیہ مرکز میں ایک درست ID لائیں۔

# tutorial_donationStep4
source: 4. Complete a health questionnaire and physical check.
ur: 4. صحت سے متعلق سوالنامہ اور جسمانی جانچ مکمل کریں۔
